// Доработайте код, чтобы он умел принимать аргументы с использованием флагов.

// Аргументы агента:
//     Флаг -a=<ЗНАЧЕНИЕ> отвечает за адрес эндпоинта HTTP-сервера (по умолчанию localhost:8080).
//     Флаг -r=<ЗНАЧЕНИЕ> позволяет переопределять reportInterval — частоту отправки метрик на сервер (по умолчанию 10 секунд).
//     Флаг -p=<ЗНАЧЕНИЕ> позволяет переопределять pollInterval — частоту опроса метрик из пакета runtime (по умолчанию 2 секунды).

// При попытке передать приложению неизвестные флаги оно должно завершаться с сообщением о соответствующей ошибке.
// Значения интервалов времени должны задаваться в секундах.
// Во всех случаях должны присутствовать значения по умолчанию.

package main
