// Задание по треку «Сервис сбора метрик и алертинга»
// Вы написали приложение с помощью пакета стандартной библиотеки net/http.
// Используя любой внешний пакет (роутер или фреймворк), совместимый с net/http, перепишите ваш код.

// Доработайте сервер так, чтобы в ответ на запрос GET http://<АДРЕС_СЕРВЕРА>/value/<ТИП_МЕТРИКИ>/<ИМЯ_МЕТРИКИ> он
// возвращал текущее значение метрики в текстовом виде со статусом http.StatusOK.
// При попытке запроса неизвестной метрики сервер должен возвращать http.StatusNotFound.
// По запросу GET http://<АДРЕС_СЕРВЕРА>/ сервер должен отдавать HTML-страницу со списком имён и
// значений всех известных ему на текущий момент метрик.
// Хендлеры должны взаимодействовать с экземпляром MemStorage при помощи соответствующих интерфейсных методов.

package main
